#############################################################################
### Търсене и извличане на информация. Приложение на дълбоко машинно обучение
### Стоян Михов
### Зимен семестър 2025/2026
#############################################################################
###
### Домашно задание 2
###
#############################################################################

import numpy as np

#############################################################

def sigmoid(x):
    return 1/(1+np.exp(-x))

def lossAndGradient(u_w, Vt, W, q):
    ###  Векторът u_w е влагането на целевата дума. shape(u_w) = M.
    ###  Матрицата Vt представя влаганията на контекстните думи. shape(Vt) = (n+1)xM.
    ###  Първият ред на Vt е влагането на коректната контекстна дума, а
    ###  следващите n реда са влаганията на извадката от негативни контекстни думи
	###  Матрицата W е параметър с теглата на квадратичната форма. shape(W) = MxM.
    ###  Векторът q съдържа логаритъм от n по вероятностите за контекстните думи. shape(q) = n+1.
    ###
    ###  функцията връща J -- загубата в тази точка;
    ###                  du_w -- градиентът на J спрямо u_w;
    ###                  dVt --  градиентът на J спрямо Vt.
    ###                  dW --  градиентът на J спрямо W.
    #############################################################################
    #### Начало на Вашия код. На мястото на pass се очакват 7-15 реда
    
    delta = [1] + [0 for i in range(len(q) - 1)]

    J = -(np.log(sigmoid(np.dot(np.dot(Vt[0], W), u_w) - q[0])) + np.sum(np.log(sigmoid(q[1:] - np.dot(np.dot(Vt[1:], W), u_w)))))

    s = sigmoid(np.dot(np.dot(Vt, W), u_w) - q) - delta

    du_w = np.dot(np.dot(s, Vt), W)
    dVt = np.dot(np.dot(s[:, np.newaxis], np.transpose(u_w[:, np.newaxis])), np.transpose(W))

    dW = np.dot(np.dot(np.transpose(Vt),s[:, np.newaxis]), np.transpose(u_w[:, np.newaxis]))


    #### Край на Вашия код
    #############################################################################

    return J, du_w, dVt, dW


def lossAndGradientCumulative(u_w, Vt, W, q):
    ###  Изчисляване на загуба и градиент за цяла партида
    ###  Тук за всяко от наблюденията се извиква lossAndGradient
    ###  и се акумулират загубата и градиентите за S-те наблюдения
    Cdu_w = []
    CdVt = []
    CJ = 0
    CdW = 0
    S = u_w.shape[0]
    for i in range(S):
        J, du_w, dVt, dW = lossAndGradient(u_w[i],Vt[i],W,q[i])
        Cdu_w.append(du_w/S)
        CdVt.append(dVt/S)
        CdW += dW/S
        CJ += J/S
    return CJ, Cdu_w, CdVt, CdW


def lossAndGradientBatched(u_w, Vt, W, q):
    ###  Изчисляване на загуба и градиент за цяла партида.
    ###  Тук едновременно се изчислява загубата и градиентите за S наблюдения.
    ###  Матрицата u_w представя влаганията на целевите думи и shape(u_w) = SxM.
    ###  Тензорът Vt представя S матрици от влагания на контекстните думи и shape(Vt) = Sx(n+1)xM.
   	###  Матрицата W е параметър с теглата на квадратичната форма. shape(W) = MxM.
    ###  Матрицата q съдържа логаритъм от n по вероятностите за контекстните думи. shape(q) = Sx(n+1).
    ###  Във всяка от S-те матрици на Vt в първия ред е влагането на коректната контекстна дума, а
    ###  следващите n реда са влаганията на извадката от негативни контекстни думи.
    ###
    ###  Функцията връща J -- загубата за цялата партида;
    ###                  du_w -- матрица с размерност SxM с градиентите на J спрямо u_w за всяко наблюдение;
    ###                  dVt --  с размерност Sx(n+1)xM -- S градиента на J спрямо Vt.
    ###                  dW --  матрица с размерност MxM -- партидния градиент на J спрямо W.
    #############################################################
    ###  От вас се очаква вместо да акумулирате резултатите за отделните наблюдения,
    ###  да използвате тензорни операции, чрез които наведнъж да получите
    ###  резултата за цялата партида. Очаква се по този начин да получите над 2 пъти по-бързо изпълнение.
    #############################################################

    #############################################################################
    #### Начало на Вашия код. На мястото на pass се очакват 10-20 реда

    s, n = np.shape(q)
    delta = [[1] + [0 for i in range(n - 1)] for j in range(s)]

    sig = sigmoid(np.einsum('ijk, ik->ij',Vt,np.dot(u_w, np.transpose(W))) - q)
    sigDelta = sig - delta

    J = np.mean(-(np.log(sig[:,0]) + np.sum(np.log(1-sig[:,1:]), axis=1)))

    temp = np.sum(Vt * sigDelta[:,:,np.newaxis], axis=1)
    du_w = np.dot(temp, W) / s  
    
    Wu = np.dot(u_w, np.transpose(W))
    dVt = sigDelta[:,:,np.newaxis] * Wu[:, np.newaxis, :] / s
    dW = np.dot(np.transpose(temp), u_w) / s

    #### Край на Вашия код
    #############################################################################
    return J, du_w, dVt, dW
